#+PROPERTY: header-args:python :exports code :eval no
#+TITLE: PyTorch: Completely Uninformed Image Modelling
#+AUTHOR: Richie Morrisroe
#+OPTIONS: toc:nil
#+OPTIONS: ^:nil
* Basic Torch

#+BEGIN_SRC python :session :results output
x = torch.Tensor(5, 3)
y = torch.rand(5, 3)
x + y
#+END_SRC

#+RESULTS:
#+begin_example


Out[20]:


 0.5180  0.7165  0.5295
 0.5059  0.6295  0.2888
 0.7477  0.8273  0.2123
 0.5817  0.4174  0.3494
 0.6014  0.1997  0.1633
[torch.FloatTensor of size 5x3]


#+end_example

* Sizes and Shapes

#+BEGIN_SRC python :session :results output
print(y.size())
np.shape #for ndarray
#+END_SRC

#+RESULTS:
: torch.Size([5, 3])
:
:
:
* Numpy Interaction

#+BEGIN_SRC python :session :results output
a = torch.ones(5)
print(a)
b = a.numpy()
print(b)
#+END_SRC

#+RESULTS:
#+begin_example

1
 1
 1
 1
 1
[torch.FloatTensor of size 5]

[ 1.  1.  1.  1.  1.]


#+end_example

